Eloise-wang/BLE_DataCollection_New/ZKFJ_BLE_wireless_uart_freertos/board/pin_mux.c
    /* PORTA19 (pin 14) is configured as PTA19 */
    PORT_SetPinMux(BOARD_INITPINBUTTON0_Collection_LED_PORT, BOARD_INITPINBUTTON0_Collection_LED_PIN, kPORT_MuxAsGpio);

    /* PORTA20 (pin 17) is configured as ADC0_A14 */
    PORT_SetPinMux(BOARD_INITPINBUTTON0_temp_Detection_PORT, BOARD_INITPINBUTTON0_temp_Detection_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA21 (pin 18) is configured as ADC0_A15 */
    PORT_SetPinMux(BOARD_INITPINBUTTON0_pressure_Detection_PORT, BOARD_INITPINBUTTON0_pressure_Detection_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC2 (pin 39) is configured as LPUART1_RX */
    PORT_SetPinMux(PORTC, 2U, kPORT_MuxAlt3);

    PORTC->PCR[2] = ((PORTC->PCR[2] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK)))

                     /* Pull Select: Enables internal pullup resistor. */
                     | PORT_PCR_PS(PCR_PS_ps1));

    /* PORTC3 (pin 40) is configured as LPUART1_TX */
    PORT_SetPinMux(PORTC, 3U, kPORT_MuxAlt3);

    /* PORTC4 (pin 42) is configured as CAN0_TX */
    PORT_SetPinMux(PORTC, 4U, kPORT_MuxAlt3);

    /* PORTC5 (pin 43) is configured as CAN0_RX */
    PORT_SetPinMux(PORTC, 5U, kPORT_MuxAlt3);

    /* PORTC6 (pin 44) is configured as ADC0_A8 */
    PORT_SetPinMux(BOARD_INITPINBUTTON0_Battery_Detection_PORT, BOARD_INITPINBUTTON0_Battery_Detection_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTC7 (pin 45) is configured as PTC7 */
    PORT_SetPinMux(BOARD_INITPINBUTTON0_Electricity_LED_PORT, BOARD_INITPINBUTTON0_Electricity_LED_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin 25) is configured as PTD2 */
    PORT_SetPinMux(BOARD_INITPINBUTTON0_BLE_LED_PORT, BOARD_INITPINBUTTON0_BLE_LED_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinButton1:
- options: {callFromInitBoot: 'false', prefix: BOARD_INITPINBUTTON1_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '44', peripheral: GPIOC, signal: 'GPIO, 6', pin_signal: ADC0_A8/PTC6/WUU0_P11/LPSPI1_PCS1/TPM1_CH5/FLEXIO0_D22, identifier: SW3, pull_select: up, pull_enable: enable,
    slew_rate: slow, open_drain: enable, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPinButton1
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPinButton1(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    const port_pin_config_t SW3 = {/* Internal pull-up resistor is enabled */
                                   .pullSelect = (uint16_t)kPORT_PullUp,
                                   /* Low internal pull resistor value is selected. */
                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                   /* Slow slew rate is configured */
                                   .slewRate = (uint16_t)kPORT_SlowSlewRate,
                                   /* Passive input filter is disabled */
                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                   /* Open drain output is enabled */
                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainEnable,
                                   /* Low drive strength is configured */
                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                   /* Normal drive strength is configured */
                                   .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                   /* Pin is configured as PTC6 */
                                   .mux = (uint16_t)kPORT_MuxAsGpio,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTC6 (pin 44) is configured as PTC6 */
    PORT_SetPinConfig(BOARD_INITPINBUTTON1_SW3_PORT, BOARD_INITPINBUTTON1_SW3_PIN, &SW3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinSWO:
- options: {callFromInitBoot: 'false', prefix: BOARD_INITPINSWO_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '10', peripheral: GPIOA, signal: 'GPIO, 4', pin_signal: ADC0_A10/CMP0_IN0/PTA4/WUU0_P2/RF_XTAL_OUT_ENABLE/RF_GPO_9/TPM0_CLKIN/TRACE_SWO/FLEXIO0_D4/BOOT_CONFIG,
    pull_select: up, pull_enable: enable, slew_rate: slow, open_drain: enable, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPinSWO
 * Description   : Configures pin routing to route SWO to GPIO (only one pin alternate (alt5) is available for SWO on KW45)
 *
 * END ****************************************************************************************************************/
void BOARD_InitPinSWO(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);

    const port_pin_config_t porta4_pin10_config = {/* Internal pull-up resistor is enabled */
                                                   .pullSelect = (uint16_t)kPORT_PullUp,
                                                   /* Low internal pull resistor value is selected. */
                                                   .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                   /* Slow slew rate is configured */
                                                   .slewRate = (uint16_t)kPORT_SlowSlewRate,
                                                   /* Passive input filter is disabled */
                                                   .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                   /* Open drain output is enabled */
                                                   .openDrainEnable = (uint16_t)kPORT_OpenDrainEnable,
                                                   /* Low drive strength is configured */
                                                   .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                   /* Normal drive strength is configured */
                                                   .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                                   /* Pin is configured as PTA4 */
                                                   .mux = (uint16_t)kPORT_MuxAsGpio,
                                                   /* Pin Control Register fields [15:0] are not locked */
                                                   .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTA4 (pin 10) is configured as PTA4 */
    PORT_SetPinConfig(PORTA, 4U, &porta4_pin10_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinLED1:
- options: {callFromInitBoot: 'false', prefix: BOARD_INITPINLED1_, coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '46', peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: ADC0_B10/PTB0/WUU0_P13/LPSPI1_PCS0/TPM1_CH0/FLEXIO0_D26, identifier: LED1, pull_select: down,
    pull_enable: disable, slew_rate: slow, open_drain: disable, drive_strength: low}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

