Eloise-wang/BLE_DataCollection_New/ZKFJ_BLE_wireless_uart_freertos/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_UnInitPinLED3
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_UnInitPinLED3(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA19 (pin 14) is configured as CMP1_IN0 */
    PORT_SetPinMux(BOARD_UNINITPINLED3_LED_G_PORT, BOARD_UNINITPINLED3_LED_G_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_UnInitPinLED4:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '17', peripheral: ADC0, signal: 'A, 14', pin_signal: ADC0_A14/CMP0_IN3/PTA20/LPSPI0_PCS2/LPUART0_TX/EWM0_IN/TPM0_CH1/RF_GPO_2/FLEXIO0_D7, identifier: LED_B}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_UnInitPinLED4
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_UnInitPinLED4(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA20 (pin 17) is configured as ADC0_A14 */
    PORT_SetPinMux(BOARD_UNINITPINLED4_LED_B_PORT, BOARD_UNINITPINLED4_LED_B_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitExtFlashPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '48', peripheral: LPSPI1, signal: SCK, pin_signal: ADC0_B12/PTB2/LPSPI1_SCK/LPUART1_TX/TPM1_CH2/FLEXIO0_D28, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: high}
  - {pin_num: '47', peripheral: LPSPI1, signal: IN, pin_signal: ADC0_B11/PTB1/LPSPI1_SIN/TPM1_CH1/FLEXIO0_D27, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: high}
  - {pin_num: '1', peripheral: LPSPI1, signal: OUT, pin_signal: ADC0_B13/PTB3/WUU0_P14/LPSPI1_SOUT/LPUART1_RX/TPM1_CH3/FLEXIO0_D29, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: high}
  - {pin_num: '46', peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: ADC0_B10/PTB0/WUU0_P13/LPSPI1_PCS0/TPM1_CH0/FLEXIO0_D26, identifier: LPSPI1_PCS0, direction: OUTPUT,
    gpio_init_state: 'true', pull_select: up, pull_enable: enable, slew_rate: fast, open_drain: disable, drive_strength: high}
  - {pin_num: '2', peripheral: GPIOB, signal: 'GPIO, 4', pin_signal: PTB4/WUU0_P15/LPSPI1_PCS3/LPUART1_CTS_b/LPI2C1_SDA/I3C0_SDA/TRGMUX0_IN0/FLEXIO0_D30, direction: OUTPUT,
    gpio_init_state: 'true', pull_select: down, pull_enable: disable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low,
    drive_strength_1: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitExtFlashPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitExtFlashPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioB);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t LPSPI1_PCS0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 46)  */
    GPIO_PinInit(BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_GPIO, BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_PIN, &LPSPI1_PCS0_config);

    gpio_pin_config_t gpiob_pin2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTB4 (pin 2)  */
    GPIO_PinInit(GPIOB, 4U, &gpiob_pin2_config);

    const port_pin_config_t LPSPI1_PCS0 = {/* Internal pull-up resistor is enabled */
                                           .pullSelect = (uint16_t)kPORT_PullUp,
                                           /* Low internal pull resistor value is selected. */
                                           .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                           /* Fast slew rate is configured */
                                           .slewRate = (uint16_t)kPORT_FastSlewRate,
                                           /* Passive input filter is disabled */
                                           .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                           /* Open drain output is disabled */
                                           .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                           /* High drive strength is configured */
                                           .driveStrength = (uint16_t)kPORT_HighDriveStrength,
                                           /* Normal drive strength is configured */
                                           .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                           /* Pin is configured as PTB0 */
                                           .mux = (uint16_t)kPORT_MuxAsGpio,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB0 (pin 46) is configured as PTB0 */
    PORT_SetPinConfig(BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_PORT, BOARD_INITEXTFLASHPINS_LPSPI1_PCS0_PIN, &LPSPI1_PCS0);

    const port_pin_config_t SI_IO1 = {/* Internal pull-up/down resistor is disabled */
                                      .pullSelect = (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                      /* High drive strength is configured */
                                      .driveStrength = (uint16_t)kPORT_HighDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as LPSPI1_SIN */
                                      .mux = (uint16_t)kPORT_MuxAlt2,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as LPSPI1_SIN */
    PORT_SetPinConfig(BOARD_INITEXTFLASHPINS_SI_IO1_PORT, BOARD_INITEXTFLASHPINS_SI_IO1_PIN, &SI_IO1);

    const port_pin_config_t SCKSI_IO1 = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* High drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_HighDriveStrength,
                                         /* Normal drive strength is configured */
                                         .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as LPSPI1_SCK */
                                         .mux = (uint16_t)kPORT_MuxAlt2,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as LPSPI1_SCK */
    PORT_SetPinConfig(BOARD_INITEXTFLASHPINS_SCKSI_IO1_PORT, BOARD_INITEXTFLASHPINS_SCKSI_IO1_PIN, &SCKSI_IO1);

    const port_pin_config_t SO_IO1 = {/* Internal pull-up/down resistor is disabled */
                                      .pullSelect = (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                      /* High drive strength is configured */
                                      .driveStrength = (uint16_t)kPORT_HighDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as LPSPI1_SOUT */
                                      .mux = (uint16_t)kPORT_MuxAlt2,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as LPSPI1_SOUT */
    PORT_SetPinConfig(BOARD_INITEXTFLASHPINS_SO_IO1_PORT, BOARD_INITEXTFLASHPINS_SO_IO1_PIN, &SO_IO1);

    const port_pin_config_t portb4_pin2_config = {/* Internal pull-up/down resistor is disabled */
                                                  .pullSelect = (uint16_t)kPORT_PullDisable,
                                                  /* Low internal pull resistor value is selected. */
                                                  .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                  /* Fast slew rate is configured */
                                                  .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                  /* Passive input filter is disabled */
                                                  .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                  /* Open drain output is disabled */
                                                  .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                  /* Low drive strength is configured */
                                                  .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                  /* Normal drive strength is configured */
                                                  .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                                  /* Pin is configured as PTB4 */
                                                  .mux = (uint16_t)kPORT_MuxAsGpio,
                                                  /* Pin Control Register fields [15:0] are not locked */
                                                  .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB4 (pin 2) is configured as PTB4 */
    PORT_SetPinConfig(PORTB, 4U, &portb4_pin2_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_DeinitExtFlashPins:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '46', peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: ADC0_B10/PTB0/WUU0_P13/LPSPI1_PCS0/TPM1_CH0/FLEXIO0_D26, identifier: LPSPI1_PCS0, direction: OUTPUT,
    gpio_init_state: 'false', pull_select: down, pull_enable: disable, slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '47', peripheral: GPIOB, signal: 'GPIO, 1', pin_signal: ADC0_B11/PTB1/LPSPI1_SIN/TPM1_CH1/FLEXIO0_D27, pull_select: down, pull_enable: disable, slew_rate: fast,
    open_drain: disable, drive_strength: low}
  - {pin_num: '48', peripheral: GPIOB, signal: 'GPIO, 2', pin_signal: ADC0_B12/PTB2/LPSPI1_SCK/LPUART1_TX/TPM1_CH2/FLEXIO0_D28, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '1', peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: ADC0_B13/PTB3/WUU0_P14/LPSPI1_SOUT/LPUART1_RX/TPM1_CH3/FLEXIO0_D29, pull_select: down, pull_enable: disable,
    slew_rate: fast, open_drain: disable, drive_strength: low}
  - {pin_num: '2', peripheral: GPIOB, signal: 'GPIO, 4', pin_signal: PTB4/WUU0_P15/LPSPI1_PCS3/LPUART1_CTS_b/LPI2C1_SDA/I3C0_SDA/TRGMUX0_IN0/FLEXIO0_D30, direction: OUTPUT,
    gpio_init_state: 'false', pull_select: down, pull_enable: disable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low,
    drive_strength_1: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

