Eloise-wang/BLE_DataCollection_New/ZKFJ_BLE_wireless_uart_freertos/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_DeinitExtFlashPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_DeinitExtFlashPins(void)
{
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioB);
    /* Clock Configuration: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t LPSPI1_PCS0_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 46)  */
    GPIO_PinInit(BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_GPIO, BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_PIN, &LPSPI1_PCS0_config);

    gpio_pin_config_t gpiob_pin2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB4 (pin 2)  */
    GPIO_PinInit(GPIOB, 4U, &gpiob_pin2_config);

    const port_pin_config_t LPSPI1_PCS0 = {/* Internal pull-up/down resistor is disabled */
                                           .pullSelect = (uint16_t)kPORT_PullDisable,
                                           /* Low internal pull resistor value is selected. */
                                           .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                           /* Fast slew rate is configured */
                                           .slewRate = (uint16_t)kPORT_FastSlewRate,
                                           /* Passive input filter is disabled */
                                           .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                           /* Open drain output is disabled */
                                           .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                           /* Low drive strength is configured */
                                           .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                           /* Normal drive strength is configured */
                                           .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                           /* Pin is configured as PTB0 */
                                           .mux = (uint16_t)kPORT_MuxAsGpio,
                                           /* Pin Control Register fields [15:0] are not locked */
                                           .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB0 (pin 46) is configured as PTB0 */
    PORT_SetPinConfig(BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_PORT, BOARD_DEINITEXTFLASHPINS_LPSPI1_PCS0_PIN, &LPSPI1_PCS0);

    const port_pin_config_t SI_IO1 = {/* Internal pull-up/down resistor is disabled */
                                      .pullSelect = (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as PTB1 */
                                      .mux = (uint16_t)kPORT_MuxAsGpio,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB1 (pin 47) is configured as PTB1 */
    PORT_SetPinConfig(BOARD_DEINITEXTFLASHPINS_SI_IO1_PORT, BOARD_DEINITEXTFLASHPINS_SI_IO1_PIN, &SI_IO1);

    const port_pin_config_t SCKSI_IO1 = {/* Internal pull-up/down resistor is disabled */
                                         .pullSelect = (uint16_t)kPORT_PullDisable,
                                         /* Low internal pull resistor value is selected. */
                                         .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                         /* Fast slew rate is configured */
                                         .slewRate = (uint16_t)kPORT_FastSlewRate,
                                         /* Passive input filter is disabled */
                                         .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                         /* Open drain output is disabled */
                                         .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                         /* Low drive strength is configured */
                                         .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                         /* Normal drive strength is configured */
                                         .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                         /* Pin is configured as PTB2 */
                                         .mux = (uint16_t)kPORT_MuxAsGpio,
                                         /* Pin Control Register fields [15:0] are not locked */
                                         .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB2 (pin 48) is configured as PTB2 */
    PORT_SetPinConfig(BOARD_DEINITEXTFLASHPINS_SCKSI_IO1_PORT, BOARD_DEINITEXTFLASHPINS_SCKSI_IO1_PIN, &SCKSI_IO1);

    const port_pin_config_t SO_IO1 = {/* Internal pull-up/down resistor is disabled */
                                      .pullSelect = (uint16_t)kPORT_PullDisable,
                                      /* Low internal pull resistor value is selected. */
                                      .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                      /* Fast slew rate is configured */
                                      .slewRate = (uint16_t)kPORT_FastSlewRate,
                                      /* Passive input filter is disabled */
                                      .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                      /* Open drain output is disabled */
                                      .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                      /* Low drive strength is configured */
                                      .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                      /* Normal drive strength is configured */
                                      .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                      /* Pin is configured as PTB3 */
                                      .mux = (uint16_t)kPORT_MuxAsGpio,
                                      /* Pin Control Register fields [15:0] are not locked */
                                      .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB3 (pin 1) is configured as PTB3 */
    PORT_SetPinConfig(BOARD_DEINITEXTFLASHPINS_SO_IO1_PORT, BOARD_DEINITEXTFLASHPINS_SO_IO1_PIN, &SO_IO1);

    const port_pin_config_t portb4_pin2_config = {/* Internal pull-up/down resistor is disabled */
                                                  .pullSelect = (uint16_t)kPORT_PullDisable,
                                                  /* Low internal pull resistor value is selected. */
                                                  .pullValueSelect = (uint16_t)kPORT_LowPullResistor,
                                                  /* Fast slew rate is configured */
                                                  .slewRate = (uint16_t)kPORT_FastSlewRate,
                                                  /* Passive input filter is disabled */
                                                  .passiveFilterEnable = (uint16_t)kPORT_PassiveFilterDisable,
                                                  /* Open drain output is disabled */
                                                  .openDrainEnable = (uint16_t)kPORT_OpenDrainDisable,
                                                  /* Low drive strength is configured */
                                                  .driveStrength = (uint16_t)kPORT_LowDriveStrength,
                                                  /* Normal drive strength is configured */
                                                  .driveStrength1 = (uint16_t)kPORT_NormalDriveStrength,
                                                  /* Pin is configured as PTB4 */
                                                  .mux = (uint16_t)kPORT_MuxAsGpio,
                                                  /* Pin Control Register fields [15:0] are not locked */
                                                  .lockRegister = (uint16_t)kPORT_UnlockRegister};
    /* PORTB4 (pin 2) is configured as PTB4 */
    PORT_SetPinConfig(PORTB, 4U, &portb4_pin2_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinLPUART0_RTS:
- options: {callFromInitBoot: 'false', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: '14', peripheral: LPUART0, signal: RTS, pin_signal: CMP1_IN0/PTA19/WUU0_P4/LPSPI0_SCK/LPUART0_RTS_b/LPI2C0_SCL/TPM0_CH2/RF_GPO_1, eft_interrupt: disable,
    pull_select: down, pull_enable: disable, pull_value: low, slew_rate: fast, passive_filter: disable, open_drain: disable, drive_strength: low, drive_strength_1: normal}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

